/*
Семинар 2. Простые алгоритмы на C#

Задание 1. Совместная работа

Примеры
a = 256 => 26
a = 891 => 81


*/
// int a = 456;
// int b = a / 100;
// int c = a % 10;

// Console.Write($"{b}{c}");


/*
Задание 2. Работа в сессионных залах 

*/

// int a = 859;
// int b = a / 10 % 10;
// int c = a % 10;

// int count = 0;
// int e = 1;

// while (count < c)
//     {
//         e = e * b;
//         count++;
//     }

// Console.WriteLine(e);

/*
Семинар 2. Простые алгоритмы на C#

Задание 3. Работа в сессионных залах

*/

// int a = 14;
// int b = 7;

// if (a % b == 0)
//     {
//         Console.WriteLine($"Число {a} кратно {b}");
//     }
// else
//     {
//         int c = a % b;
//         Console.WriteLine(c);
//     }



// int a = 859;
// int b = a / 10 % 10;
// int c = a % 10;

// double result = Math.Pow( b,  c);
// Console.WriteLine(result);


/*
Семинар 2. Простые алгоритмы на C#

Задание 4*. Совместная работа

// */

// int num = -4946;
// if (num < 100)
//     {
//         Console.WriteLine("Третьей цифры нет");
//     }
// else 
//     {
//         while(num > 999)
//             {
//                 num /= 10;
//             }
//             Console.WriteLine($"Третья цифра {num % 10}");
//     }